from typing import Optional

class Dictionary():
    def first_meet(full_name:str, length:int,  custom_title: Optional[str]) -> str:  
        return f'''А тебя я не знаю... Ты, значится, {full_name}!
А я Шут. Ромашковый.🤡 Я работаю на мобильных разработчиков в их мобильном подвале.
Дай-ка я на тебя взгляну...\nИзмерим твой чучундрик... Ого! Вот это питон! {length}см
{f'А погоняло твое... Ага! {custom_title}' if type(custom_title) is str else ''}'''
    
    def sticker_set_create_success(sticker_set_name:str) -> str:
        return f"Набор стикеров создан!: https://t.me/addstickers/{sticker_set_name}"
    
    help:str = "Что умеет бот"

    edit_sticker_set:str = "Изменить набор стикеров"

    create_sticker_set:str = "Создать набор стикеров"

    error:str = "Что-то мне сегодня плохо, приходи попозже..."

    exit:str = "❌ Выход"

    skip:str = "⏩ Пропустить"

    ###------------------------------------------------------------
    ###Создание набора стикеров
    ###------------------------------------------------------------

    error_sticker_set_create:str = "Ошибка создания набора стикеров"

    use_this:str = "Использовать видео стикера"

    send_sticker_placeholder:str = "Отправь видео, которым будет заменяться стикер"

    ###------------------------------------------------------------
    ###изменение набора стикеров
    ###------------------------------------------------------------

    choice_sticker_set:str = "Выбери набор стикеров, который хочешь изменить"

    sticker_set_list_is_empty:str = "Нет наборов стикеров!"

    sticker_edit_variants:str = "Вот что мы можем с ним сделать:"

    delete_sticker_set_success:str = "✅ Удалили удачно!"

    delete:str = "🗑️ Удалить"