from typing import Optional

class Dictionary():
    def first_meet(full_name:str, length:int,  custom_title: Optional[str]) -> str:  
        return f'''А тебя я не знаю... Ты, значится, {full_name}!
А я Шут. Ромашковый.🤡 Я работаю на мобильных разработчиков в их мобильном подвале.
Дай-ка я на тебя взгляну...\nИзмерим твой чучундрик... Ого! Вот это питон! {length}см
{f'А погоняло твое... Ага! {custom_title}' if type(custom_title) is str else ''}'''
    
    help = "Что умеет бот"

    error = "Что-то мне сегодня плохо, приходи попозже..."